Revit 2026 API

# ExternalFileReferenceGetLinkedFileStatus Method

---

Returns a LinkedFileStatus.Enum corresponding to the load status of the referenced file.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LinkedFileStatus GetLinkedFileStatus()
```
```vb
Public Function GetLinkedFileStatus As LinkedFileStatus
```
```cpp
public:
LinkedFileStatus GetLinkedFileStatus()
```
```fsharp
member GetLinkedFileStatus : unit -> LinkedFileStatus
```

#### Return Value

LinkedFileStatus

Options are Invalid, Loaded, Unloaded, NotFound, or Imported.

#### Reference

ExternalFileReference Class

Autodesk.Revit.DB Namespace